Repository: alexm/shadow.cat
Catalog: shadow.cat-level2.tmx
Source language: en_us
Languages: ca

source: The type is created by starting with any Object, and then requiring that this object pass the additional qualification of being a subclass of Perl's DateTime.
ca: El tipus es crea començant amb qualsevol Object i després requering que aquest objecte passi la qualificació adicional de ser una subclasse de DateTime de Perl.

source: At this point, we could continue to use this Moose-style DateTime type as we had before.
ca: En aquest punt, podem continuar utilitzant aquest DateTime de Moose com ho fèiem abans.

source: But once we've done this, we can further subtype the type.
ca: Una vegada hem fet això, podem derivar un subtipus del tipus.

source: For example, we can require that the date be a historical date (before now):
ca: Per exemple, podem requerir que la data sigui històrica (prèvia al present):

source: Now, not just any DateTime will do.
ca: Ara no funcionarà qualsevol DateTime.

source: It has to be something that isn't in the future.
ca: Ha de ser algun moment que no sigui al futur.

source: The expression in where can be any expression returning a true/false value, using $_ as a proxy for the object in question.
ca: L'expressió al where pot ser qualsevol expressió que retorni un valor cert/fals, utilitzant $_ com a proxy per a l'objecte en qüestió.

source: It'd be easier if we could still use casual forms like yesterday and 3/14/1929.
ca: Seria més senzill encara si poguèssim utilitzar expressions informals com yesterday i 3/14/1929.

source: These are both understood by Date::Manip.
ca: Date::Manip enten aquestes dues.

source: We could parse the strings with Date::Manip, then pull out the component values and hand them to DateTime, but luckily, there's already a module to do that: DateTime::Format::DateManip.
ca: Podem analitzar les cadenes amb Date::Manip, extreure els valors dels components i després entregar-los a DateTime, però afortunadament, ja hi ha un mòdul que fa això: DateTime::Format::DateManip.

source: Not bad.
ca: No està malament.

source: Our newbie horse is born yesterday, as we expect.
ca: El nostre aprenent cavall va nèixer ahir, tal com esperàvem.

source: But it'd be nice to just drop yesterday into the slot and have it do all of that for us.
ca: Però estaria bé simplement posar yesterday al paràmetre i deixar que ho faci tot per nosaltres.

source: And with coercions, we can.
ca: I amb coercions, podem fer-ho.

source: Since passing a simple string as the birthtime is illegal, we can inform Moose that it should take that string and run it through DateTime::Format::DateManip automatically:
ca: Com que passar una cadena com a aniversari no està permés, podem indicar a Moose que agafi la cadena i la passi per DateTime::Format::DateManip automàticament:

source: The via code block takes $_ as the input value, which is expected to be a string (Str).
ca: El bloc via agafa $_ com un valor d'entrada, que s'espera que sigui una cadena (Str).

source: The last expression evaluated in the code is the new HistoricalDateTime value.
ca: L'última expressió avaluada al codi és el nou valor HistoricalDateTime.

source: We then permit this coercion to be used by adding coerce into the attribute declaration:
ca: Després permetem l'ús d'aquesta coacció afegint coerce a la declaració de l'atribut:

source: Now, the born slot accepts either an explicit DateTime as before, or a simple string.
ca: Ara el paràmetre born accepta o bé un DateTime explícit com abans, o bé una cadena simple.

source: The string must be acceptable to Date::Manip, which will be used to convert the string into a DateTime object as our object is created.
ca: La cadena ha de ser acceptable per Date::Manip, que serà utilitzat per convertir la cadena a un objecte DateTime quan el nostre objecte sigui creat.

source: Also, because the type constraint is still in place, the verification to ensure the result is a historical date is still active.
ca: A més, com que la coacció de tipus està a lloc, la verificació per assegurar que el resultat és una data històrica encara està activa.

source: Besides the named classes and Str, Moose::Util::TypeConstraints also establishes types of things like Bool and HashRef.
ca: A més dels noms de les classes i Str, Moose::Util::TypeConstraints també estableix els tipus de coses com Bool i HashRef.

source: We could even have multiple coercions defined, as long as they are distinct.
ca: Fins i tot podríem tenir múltiples coaccions definides, sempre i quan siguin diferents.

source: For example, we could use a hashref in the birthtime slot to indicate that we are passing key/value pairs to be handed to a DateTime constructor directly:
ca: Per exemple, podem utilitzar una referència a una taula de dispersió al paràmetre aniversari per indicar que estem passant parells clau/valor perquè siguin entregats directament a un constructor DateTime:

source: And now we can use a hashref to define the birthdate:
ca: I ara podem definir una referència a una taula de dispersió per definir l'aniversari:

source: If the value for born is a DateTime, it's used directly.
ca: Si el valor per a born és un DateTime, s'utilitza directament.

source: If it's a string, it's passed to DateTime::Format::DateManip.
ca: Si és una cadena, es passa a DateTime::Format::DateManip.

source: And if it's a hashref, it's passed directly as a flattened list to the DateTime constructor.
ca: I si és una referència a una taula de dispersió, es passa directament com una llista aplanada al constructor DateTime.

source: Very cool.
ca: Genial.

source: The value we specify for a default is subject to the same coercions and type checking.
ca: El valor que especifiquem per a default està subjecte a les mateixes coaccions i comprovacions de tipus.

source: We can update born as:
ca: Podem actualitzar born a:

source: And now our animals default to being ``born yesterday''.
ca: I ara, el valor per defecte dels animals a ``nascut ahir''.

source: Note that the default value is still subject to the type constraints, so if we replace yesterday with tomorrow, the default value will be rejected properly.
ca: Observeu que el valor per defecte encara està subjecte a les restriccions de tipus, per tant si substituïm yesterday per tomorrow, el valor per defecte serà rebutjat.

source: Note that the coercion happens as each object is created, so a default value of one minute ago will give us a new time each time it is called.
ca: Observeu que la coacció passa a mesura que cada objecte es crea, per tant el valor per defecte one minute ago ens donarà una data diferent cada vegada que sigui cridat.

source: While we're on things we can do to attributes, another interesting item is lazy.
ca: Mentre estudiem què podem fer als atributs, un altre element interessant és lazy.

source: If the default value is expensive to compute, we can say ``don't really do this until you need to do it''.
ca: Si el valor per defecte és car de calcular, podem dir ``no facis això fins que ho necessitis''.

source: For example, turning yesterday into a DateTime is slightly expensive, so we can flag that as lazy:
ca: Per exemple, convertir yesterday a un objecte DateTime és una mica car, així que ho podem marcar com lazy:

source: Speaking of great support, as I was writing that last paragraph, I noticed a bug in the result, and chatting with Stevan on IRC got it fixed before I could turn this article in.
ca: I parlant de suport fantàstic, mentre escrivia aquest últim pàrraf vaig descobrir un error de programació, i commentar-ho amb Stevan a l'IRC ho va solucionar abans que jo entregués l'article.

source: Yeay.
ca: Visca.

source: Anything built with Moose has a very high degree of introspection available.
ca: Qualsevol cosa construïda amb Moose té disponible un grau molt alt d'introspecció.

source: For example, we can ask one of our animal friends to give us the meta object, with which we can make further requests:
ca: Per exemple, podem demanar a un dels nostres amics animals que ens doni l'objecte meta, amb el què podrem fer més peticions:

source: We can ask the horse for the roles:
ca: Podem demanar al cavall per els roles:

source: In this case, we see that we've mixed in one role (of type Moose::Meta::Role, and get the name with:
ca: En aquest cas, veiem que hem obtingut un rol (de tipus Moose::Meta::Role), i aconseguit el nom amb:

source: which gives us Animal as we might expect.
ca: cosa que ens dona un Animal tal com esperàvem.

source: We can also ask the meta object for all applicable methods:
ca: Podem demanar a l'objecte meta tots els mètodes aplicables:

source: which returns
ca: cosa que retorna

source: Nice.
ca: Genial.

source: Not sure what BEGIN is doing in there, but the rest are things that we've defined.
ca: No estic segur de què fa BEGIN aquí, però la resta són elements que hem definit.

source: Many of these methods relate to the attributes, but we'd can query those definitively using compute_all_applicable_attributes instead:
ca: Molts d'aquests mètodes es relacionen amb atributs, però podem demanar aquests definitivament utilitzant compute_all_applicable_attributes:

source: The result is a set of Moose::Meta::Attribute objects.
ca: El resultat és un conjunt d'objectes Moose::Meta::Attribute.

source: We can map them through name as before to get the names:
ca: Podem utilitzar el «map« sobre name com abans per aconseguir els noms:

source: We can also see if they have setters:
ca: També podem veure si tenen «setters»:

source: Note that only color has a setter: the other two are read-only, so this makes sense.
ca: Observeu que només color té un «setter»: els altres dos no són modificables, així que això té sentit.

source: As noted above, Moose is still being actively developed, but is production ready as long as you stick with things that work.
ca: Tal com s'ha comentat abans, Moose encara està sent desenvolupat de forma activa, però és production ready mentre us mantingueu en les coses que funcionen.

source: You'll find the latest Moose in the CPAN, along with some other core plugins, typically in the MooseX namespace.
ca: Trobareu l'últim Moose al CPAN, juntament amb algun altre complement base, normalment a l'espai de noms MooseX.

source: For example, MooseX::Getopt allows you to define your @ARGV processing using type coercion, type constraints, and all that jazz.
ca: Per exemple, MooseX::Getopt us permet definir el vostre procés de @ARGV utilitzant coacció de tipus, restriccions de tipus, i totes aquestes coses.

source: I haven't had time to play with that yet, but it's on my to-do list, so perhaps I'll cover that in a future column.
ca: No he tingut temps per jugar-hi encara, però està a la meva llista de coses pendents, així que potser en parlaré a una columna futura.

source: Similarly, MooseX::Object::Pluggable makes it easy to write classes that are pluggable, meaning that they can work well with plugins that define additional methods and attributes.
ca: De forma similar, MooseX::Object::Pluggable simplifica l'escriptura de classes que són pluggable, que significa que poden treballar bé amb complements que defineixen mètodes i atributs adicionals.

source: (Think of a generic web server or IRC bot object that has individually selectable additional behaviors.) Again, I'm just noticing these, and they look like they are worthy of their own descriptions later.
ca: (Penseu en un servidor web genèric o un «bot« IRC que té comportaments adicionals seleccionables individualment.) De nou, m'estic adonant ara d'aquests, i sembla que valgui la pena fer-ne una descripció especial més tard.

source: Also note that Moose is itself built on Class::MOP, which is a framework for making class frameworks.
ca: Observeu a més que el mateix Moose està construit sobre Class::MOP, que és un entorn de treball per crear entorns de treball de classes.

source: Perhaps other projects besides Moose will be using Class::MOP as a starting point as well.
ca: Potser altres projectes a més de Moose també utilitzaran Class::MOP com a punt de partida.

source: For example, the infrastructure of Class::Prototyped (which I use in my own CGI::Prototype) might be built on Class::MOP, giving it more flexibility and robustness.
ca: Per exemple, l'infraestructura de Class::Prototyped (que utilitzo al meu CGI::Prototype) podria construir-se sobre Class::MOP, proporcionant més flexibilitat i robustesa.

source: I hope you've enjoyed this two-part introduction to Moose.
ca: Espero que hagueu gaudit d'aquesta introducció en dues parts a Moose.

source: Have fun playing with a production-ready flexible object-building system.
ca: Divertiu-vos jugant amb un sistema de construcció d'objectes flexible preparat per a producció.

source: Until next time, enjoy!
ca: Fins aleshores, gaudiu!

source: =head1 NAME
ca: =head1 NAME/NOM

source: =head1 AUTHOR
ca: =head1 AUTOR

source: =head1 COPYRIGHT AND LICENSE
ca: =head1 COPYRIGHT I LLICÈNCIA

source: This library is free software; you can redistribute it and/or modify it under the same terms as Perl itself.
ca: Aquesta llibreria és programari lliure; podeu redistribuir-la i/o modificar-la amb les mateixes condicions del propi Perl.

source: Moose::Manual::Concepts - Moose OO concepts
ca: Moose::Manual::Concepts - Conceptes d'OO a Moose

source: =head1 MOOSE CONCEPTS (VS "OLD SCHOOL" Perl)
ca: =head1 CONCEPTES DE MOOSE (contra Perl "de la vella escola")

source: In the past, you may not have thought too much about the difference between packages and classes, attributes and methods, constructors and methods, etc.
ca: En el passat potser no heu pensat massa en la diferència entre paquets i classes, atributs i mètodes, constructors i mètodes, etc.

source: With Moose, these are all conceptually separate things, even though under the hood they're implemented with plain old Perl.
ca: Amb Moose totes aquestes són coses conceptualment separades, tot i que internament s'implementa amb Perl tradicional.

source: Our meta-object protocol (aka MOP) provides well-defined introspection features for each of those concepts, and Moose in turn provides distinct sugar for each of them.
ca: El nostre protocol de meta-objectes (també conegut com MOP) ofereix característiques d'introspecció ben definides per a cadascun d'aquests conceptes, i al seu torn Moose ofereix una diferent sintaxi ensucrada per a cadascun d'ells.

source: Moose also introduces additional concepts such as roles, method modifiers, and declarative delegation.
ca: Moose també introdueix conceptes addicionals com ara els rols, els modificadors de mètodes i la delegació declarativa.

source: Knowing what these concepts mean in Moose-speak, and how they used to be done in old school Perl 5 OO is a good way to start learning to use Moose.
ca: Conèixer el que volen dir aquests conceptes en l'argot de Moose i com s'acostumaven a utilitzar en l'OO de Perl 5 de la vella escola és una bona manera de començar a aprendre a utilitzar Moose.

source: =head2 Class
ca: =head2 Classe

source: When you say "use Moose" in a package, you are making your package a class.
ca: Quan dieu "use Moose" en un paquet, esteu convertint en vostre paquet en una classe.

source: At its simplest, a class will consist simply of attributes and/or methods.
ca: La manera més simple de definir una classe consistirà únicament d'atributs i/o mètodes.

source: It can also include roles, method modifiers, and more.
ca: També pot incloure rols, modificadors de mètodes i més.

source: A class I<has> zero or more B<attributes>.
ca: Una classe I<té> zero o més B<atributs>.

source: A class I<has> zero or more B<methods>.
ca: Una classe I<té> zero o més B<mètodes>.

source: A class I<has> zero or more superclasses (aka parent classes).
ca: Una classe I<té> zero o més superclasses (o classes pare).

source: A class inherits from its superclass(es).
ca: Una classe hereta de les seves superclasses.

source: A class I<has> zero or more B<method modifiers>.
ca: Una classe I<té> zero o més B<modificadors de mètodes>.

source: These modifiers can apply to its own methods or methods that are inherited from its ancestors.
ca: Aquests modificadors es poden aplicar als seus propis mètodes o als mètodes heretats dels seus ancestres.

source: A class I<does> (and I<consumes>) zero or more B<roles>.
ca: Una classe I<fa> (i I<consumeix>) zero o més B<rols>.

source: A class I<has> a B<constructor> and a B<destructor>.
ca: Una classe I<té> un B<constructor> i un B<destructor>.

source: These are provided for you "for free" by Moose.
ca: Aquests us els ofereix Moose de franc.

source: The B<constructor> accepts named parameters corresponding to the class's attributes and uses them to initialize an B<object instance>.
ca: El B<constructor> accepta paràmetres amb nom que corresponguin als atributs de la classe i els utilitza per inicialitzar una B<instància de l'objecte>.

source: A class I<has> a B<metaclass>, which in turn has B<meta-attributes>, B<meta-methods>, and B<meta-roles>.
ca: Una classe I<té> una B<meta-classe>, que al seu torn té B<meta-atributs>, B<meta-mètodes>, i B<meta-rols>.

source: This metaclass I<describes> the class.
ca: Aquesta meta-classe I<descriu> la classe.

source: A class is usually analogous to a category of nouns, like "People" or "Users".
ca: Una classe normalment és anàloga a una categoria de noms, com ara "Persones" o "Usuaris".

source: # now it's a Moose class!
ca: # ara és una classe de Moose!

source: =head2 Attribute
ca: =head2 Atribut

source: An attribute is a property of the class that defines it.
ca: Un atribut és una propietat que defineix una classe.

source: It I<always> has a name, and it I<may have> a number of other properties.
ca: I<Sempre> té un nom i I<pot tenir> d'altres propietats.

source: These properties can include a read/write flag, a B<type>, accessor method names, B<delegations>, a default value, and more.
ca: Aquestes propietats inclouen un indicador de lectura/escriptura, un B<tipus>, noms dels mètodes accessors, B<delegacions>, un valor predeterminat, i més.

source: Attributes I<are not> methods, but defining them causes various accessor methods to be created.
ca: Els atributs I<no són> mètodes, però en definir-los es creen diversos mètodes accessors.

source: At a minimum, a normal attribute will always have a reader accessor method.
ca: Com a mínim, un atribut normal tindrà sempre un mètode accessor de lectura.

source: Many attributes also have other methods, such as a writer method, clearer method, and predicate method ("has it been set?").
ca: Molts atributs també tenen altres mètodes, com ara un mètode d'escriptura, un mètode de neteja, i un mètode de predicat ("s'ha establert?").

source: An attribute may also define B<delegations>, which will create additional methods based on the delegation mapping.
ca: Un atribut també pot definir B<delegacions>, que crearan mètodes addicionals basats en el mapatge de delegacions.

source: By default, Moose stores attributes in the object instance, which is a hashref, I<but this is invisible to the author of a Moose-based class>!
ca: Per defecte, Moose emmagatzema els atributs a la instància de l'objecte, què és una referència a una taula de dispersió, I<però això és invisible a l'autor d'una classe basada en Moose>!

source: It is best to think of Moose attributes as "properties" of the I<opaque> B<object instance>.
ca: És millor pensar en els atributs de Moose com a "propietats" de la B<instància I<opaca> de l'objecte>.

source: These properties are accessed through well-defined accessor methods.
ca: Aquestes propietats s'accedeixen mitjançant mètodes accessors ben definits.

source: An attribute is something that the class's members have.
ca: Un atribut és quelcom que tenen els membres de la classe.

source: For example, People have first and last names.
ca: Per exemple, les persones tenen nom i cognom.

source: Users have passwords and last login datetimes.
ca: Els usuaris tenen contrasenyes i la data i hora de darrera connexió.

source: =head2 Method
ca: =head2 Mètode

source: A B<method> is very straightforward.
ca: Un B<mètode> és força pim pam.

source: Any subroutine you define in your class is a method.
ca: Qualsevol subrutina que definiu a la vostra classe és un mètode.

source: B<Methods> correspond to verbs, and are what your objects can do.
ca: Els B<mètodes> es corresponen amb verbs i són el que els vostres objectes poden fer.

source: For example, a User can login.
ca: Per exemple, un Usuari pot connectar-se.

source: =head2 Roles
ca: =head2 Rols

source: A role is something that a class I<does>.
ca: Un rol és quelcom que una classe I<fa>.

source: We also say that classes I<consume> roles.
ca: Diem que les classes I<consumeixen> rols.

source: For example, a Machine class might do the Breakable role, and so could a Bone class.
ca: Per exemple, una classe Màquina podria fer el rol Trencable, tal com podria fer-ho una classe Os.

source: A role is used to define some concept that cuts across multiple unrelated classes, like "breakability", or "has a color".
ca: Un rol s'utilitza per definit algun concepte que s'aplica a múltiples classes que no estan relacionades, com ara la "trencabilitat", o "té un color".

source: A role I<has> zero or more B<attributes>.
ca: Un rol I<té> zero o més B<atributs>.

source: A role I<has> zero or more B<methods>.
ca: Un rol I<té> zero o més B<mètodes>.

source: A role I<has> zero or more B<method modifiers>.
ca: Un rol I<té> zero o més B<modificadors de mètode>.

source: A role I<has> zero or more B<required methods>.
ca: Un rol I<té> zero o més B<mètodes necessaris>.

source: A required method is not implemented by the role.
ca: Un mètode necessari no s'implementa dins el rol.

source: Required methods say "to use this Role you must implement this method".
ca: Els mètodes necessaris diuen "per utilitzar aquest Rol heu d'implementar aquest mètode".

source: A role I<has> zero or more B<excluded roles>.
ca: Un rol I<té> zero o més B<rols exclosos>.

source: An excluded role is a role that the role doing the excluding says it cannot be combined with.
ca: Un rol exclós és un rol que no es pot combinar amb el rol que indica l'exclusió.

source: Roles are I<composed> into classes (or other roles).
ca: Els rols es I<composen> dins de les classes (o d'altres rols).

source: When a role is composed into a class, its attributes and methods are "flattened" into the class.
ca: Quan un rol es composa dins d'una classe els seus atributs i els seus mètodes se "simplifiquen" dins de la classe.

source: Roles I<do not> show up in the inheritance hierarchy.
ca: Els rols I<no> apareixen a la jerarquia de l'herència.

source: When a role is composed, its attributes and methods appear as if they were defined I<in the consuming class>.
ca: Quan es composa un rol els seus atributs i mètodes apareixen com si s'haguessin definit I<a la classe que el consumeix>.

source: Role are somewhat like mixins or interfaces in other OO languages.
ca: Els rols són quelcom semblant als I<mixins> o les interfícies en altres llenguatges amb OO.

source: =head2 Method modifiers
ca: =head2 Modificadors de mètode

source: A B<method modifier> is a hook that is called when a named method is called.
ca: Un B<modificador de mètode> és un ganxo que es crida quan es crida un mètode amb nom.

source: For example, you could say "before calling C<login()>, call this modifier first".
ca: Per exemple, podeu dir "abans de cridar C<login()>, primer crideu aquest modificador".

source: Modifiers come in different flavors like "before", "after", "around", and "augment", and you can apply more than one modifier to a single method.
ca: Els modificadors tenen diferents aspectes com ara "before", "after", "around", i "augment", i podeu aplicar més d'un modificador a un sol mètode.
